In [1]:
import pandas as pd

In [3]:
from IPython.display import display

In [2]:
employee_data = {
    'eid': ['E001', 'E002', 'E003', 'E004', 'E005', 'E006', 'E007'],
    'ename': ['Arun', 'William', 'Ramesh', 'Rekha', 'Syed', 'Gurpreet', 'Susan'],
    'salary': [50000, 45000, 45000, 35000, 30000, 80000, 85000],
    'deptid': ['D001', 'D002', 'D004', 'D003', 'D002', 'D003', 'D004']
}
employee = pd.DataFrame(employee_data)

dept_data = {
    'deptid': ['D001', 'D002', 'D003', 'D004'],
    'dname': ['Accounts', 'Marketing', 'Sales', 'Production'],
    'building': ['B1', 'B2', 'B3', 'B1']
}

department = pd.DataFrame(dept_data)

In [32]:
a = ['E001', 'E002', 'E003', 'E004', 'E005', 'E006', 'E007']
b = ['Arun', 'William', 'Ramesh', 'Rekha', 'Syed', 'Gurpreet', 'Susan']
c = [50000, 45000, 45000, 35000, 30000, 80000, 85000]
d = ['D001', 'D002', 'D004', 'D003', 'D002', 'D003', 'D004']
for i in range (7):
    print(f"insert into employee values('{a[i]}', '{b[i]}', {c[i]}, '{d[i]}');")

insert into employee values('E001', 'Arun', 50000, 'D001');
insert into employee values('E002', 'William', 45000, 'D002');
insert into employee values('E003', 'Ramesh', 45000, 'D004');
insert into employee values('E004', 'Rekha', 35000, 'D003');
insert into employee values('E005', 'Syed', 30000, 'D002');
insert into employee values('E006', 'Gurpreet', 80000, 'D003');
insert into employee values('E007', 'Susan', 85000, 'D004');

In [7]:
display(employee)
display(department)

    eid     ename  salary deptid
0  E001      Arun   50000   D001
1  E002   William   45000   D002
2  E003    Ramesh   45000   D004
3  E004     Rekha   35000   D003
4  E005      Syed   30000   D002
5  E006  Gurpreet   80000   D003
6  E007     Susan   85000   D004

  deptid       dname building
0   D001    Accounts       B1
1   D002   Marketing       B2
2   D003       Sales       B3
3   D004  Production       B1

## Question 2

How many rows will be fetched by the following query?

```sql
SELECT eid FROM Employee WHERE deptid = ’D003’ AND salary > 35000
EXCEPT
SELECT e.eid FROM Employee e,Department d
WHERE e.deptid = d.deptid AND d.building = ’B3’;
```

In [11]:
df2 = employee[(employee['deptid'] == 'D003')&(employee['salary'] > 35000)]
display(df2)

    eid     ename  salary deptid
5  E006  Gurpreet   80000   D003

In [17]:
display(df2[['eid']])

    eid
5  E006

In [18]:
part1 = df2[['eid']]

In [19]:
part1

    eid
5  E006

In [14]:
cp_df = pd.merge(employee, department, on='deptid', how='inner')
display(cp_df)

    eid     ename  salary deptid       dname building
0  E001      Arun   50000   D001    Accounts       B1
1  E002   William   45000   D002   Marketing       B2
2  E005      Syed   30000   D002   Marketing       B2
3  E003    Ramesh   45000   D004  Production       B1
4  E007     Susan   85000   D004  Production       B1
5  E004     Rekha   35000   D003       Sales       B3
6  E006  Gurpreet   80000   D003       Sales       B3

In [15]:
# show the rows where building is B3
cp_df_2 = cp_df[cp_df['building'] == 'B3']
display(cp_df_2)

    eid     ename  salary deptid  dname building
5  E004     Rekha   35000   D003  Sales       B3
6  E006  Gurpreet   80000   D003  Sales       B3

In [16]:
display(cp_df_2[['eid']])

    eid
5  E004
6  E006

In [20]:
part2 = cp_df_2[['eid']]

In [21]:
part2

    eid
5  E004
6  E006

In [22]:
print(part1)
print(part2)

    eid
5  E006
    eid
5  E004
6  E006

## Question 3

What will be the output of the following query?

```sql
SELECT e.eid FROM Employee e,Department d
WHERE d.deptid = e.deptid AND d.building IN(’B2’)
UNION ALL
SELECT eid FROM Employee WHERE deptid = ’D002’
EXCEPT ALL
SELECT eid FROM Employee WHERE deptid = ’D002’;
```

In [24]:
# select e.eid from Employee e, Dept d where same dept id and building b2

cp_df = pd.merge(employee, department, on='deptid', how='inner')

cp_df_3 = cp_df[cp_df['building'] == 'B2']
display(cp_df_3)

    eid    ename  salary deptid      dname building
1  E002  William   45000   D002  Marketing       B2
2  E005     Syed   30000   D002  Marketing       B2

In [26]:
part3_1 = cp_df_3[['eid']]
part3_1

    eid
1  E002
2  E005

In [27]:
df3_2 = employee[(employee['deptid'] == 'D002')]
display(df3_2)

    eid    ename  salary deptid
1  E002  William   45000   D002
4  E005     Syed   30000   D002

In [28]:
part3_2 = df3_2[['eid']]
part3_2

    eid
1  E002
4  E005

## Question 4

How many rows will be printed as the result of the following query?

```sql
SELECT MIN(salary),deptid FROM Employee GROUP BY deptid
INTERSECT
SELECT e1.salary,e1.deptid FROM Employee e1, Employee e2
WHERE e1.salary > e2.salary;
```

In [ ]:
e1 = employee
e2 = employee
cp_df_4 = pd.merge